#+title:     Ectorepo: Tensorflow
#+author:    David Conner
#+email:     noreply@te.xel.io
#+PROPERTY: header-args+ :comments none :var enable-restclient=(setq-local restclient-enable-eval "yes")

A list of Tensorflow and Python ML tools.To learn how to use this Repo repo, see
the [[https://github.com/ectorepo/ectorepo][ectorepo/ectorepo]] Repo ... repo.

#+begin_src xml :tangle default.xml
<manifest>
  <include name="_remotes.xml"/>
  <default remote="github" sync-j="8" revision="refs/heads/master"/>
  <include name="tensorflow_core.xml"/>
</manifest>
#+end_src

Check rates:

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

To avoid confirmations

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil)
#+end_src

* Setup

#+name: nrepos
#+begin_src emacs-lisp
100
#+end_src

#+RESULTS: nrepos
: 100

#+name: gitorg
#+begin_src emacs-lisp :results replace vector value
"tensorflow"
#+end_src

#+RESULTS: gitorg
| tensorflow |

** Repo Sizes

Clone bundle sizes

#+name: fetchMetadata
#+headers: :var gh-org="tensorflow" :jq-args "--raw-output" :eval query :results table
#+begin_src restclient :jq "sort_by(-.size) | map([.owner.login, .name, .size, .default_branch, .archived, .updated_at])[] | @csv"
:gh-graphql-url = https://api.github.com/graphql
:gh-url-base = https://api.github.com
:gh-url-path = orgs/:gh-org/repos
:gh-token := (auth-source-pass-get 'secret "api.github.com/dcunited001^ghub")

:headers = <<
Accept: application/vnd.github+json
Authorization: Bearer :gh-token
X-GitHub-Api-Version: 2022-11-28
User-Agent: Emacs
#

GET :gh-url-base/:gh-url-path
:headers
#+end_src

#+call: fetchMetadata(gh-org="tensorflow")

#+RESULTS: fetchMetadata
| tensorflow | tensorflow                     | 1245942 | master | false | 2026-01-09T19:26:51Z |
| tensorflow | models                         |  658267 | master | false | 2026-01-09T17:34:08Z |
| tensorflow | tfjs-core                      |  380006 | master | true  | 2026-01-06T04:15:16Z |
| tensorflow | probability                    |  160145 | main   | false | 2026-01-07T03:29:14Z |
| tensorflow | lucid                          |  148135 | master | true  | 2026-01-08T02:16:52Z |
| tensorflow | tensorboard                    |  123554 | master | false | 2026-01-09T14:16:57Z |
| tensorflow | embedding-projector-standalone |   97781 | master | false | 2025-11-30T08:27:44Z |
| tensorflow | workshops                      |   55933 | master | true  | 2025-11-07T21:17:12Z |
| tensorflow | tpu                            |   48169 | master | false | 2026-01-09T12:53:24Z |
| tensorflow | rust                           |   30155 | master | false | 2026-01-09T11:24:37Z |
| tensorflow | serving                        |   19906 | master | false | 2026-01-06T15:05:05Z |
| tensorflow | tfjs-converter                 |   19683 | master | true  | 2025-12-06T17:06:55Z |
| tensorflow | tensor2tensor                  |   17508 | master | true  | 2026-01-09T19:05:05Z |
| tensorflow | haskell                        |   10161 | master | false | 2026-01-07T09:22:55Z |
| tensorflow | minigo                         |    9958 | master | true  | 2025-12-31T10:16:12Z |
| tensorflow | transform                      |    5615 | master | false | 2025-12-19T06:20:46Z |
| tensorflow | deepmath                       |    3478 | master | true  | 2026-01-05T06:42:33Z |
| tensorflow | benchmarks                     |    3203 | master | true  | 2026-01-06T15:24:00Z |
| tensorflow | kfac                           |    1811 | master | false | 2026-01-04T13:46:35Z |
| tensorflow | fold                           |    1605 | master | false | 2025-12-03T01:54:07Z |
| tensorflow | lattice                        |    1591 | master | false | 2025-12-22T10:01:19Z |
| tensorflow | profiler-ui                    |    1540 | master | false | 2025-08-08T10:01:09Z |
| tensorflow | playground                     |    1508 | master | false | 2026-01-08T23:10:39Z |
| tensorflow | nmt                            |    1262 | master | true  | 2026-01-05T09:12:12Z |
| tensorflow | ecosystem                      |     804 | master | true  | 2025-12-26T22:06:06Z |
| tensorflow | skflow                         |     779 | master | true  | 2025-12-11T18:37:14Z |
| tensorflow | metadata                       |     486 | master | false | 2026-01-08T23:36:35Z |
| tensorflow | tfrc                           |     274 | master | true  | 2025-02-21T15:50:02Z |
| tensorflow | tensorstore                    |     161 | master | true  | 2025-08-08T10:01:52Z |
| tensorflow | tensorboard-plugin-example     |      72 | master | true  | 2025-06-17T07:45:26Z |

#+NAME: tensorflowReposExclude
| .github      |


* Core

Get the core repositories. These should go into =/data/ecto/tensorflow/core=.

#+name: gitrepos-query
#+begin_example graphql
query ($org:String!) {
  organization(login:$org){
    repositories(first:100, orderBy: {field:UPDATED_AT,direction:DESC}){
      edges{
        node{
          owner{login}
          name
          defaultBranchRef{prefix name}
          url
          updatedAt
          isArchived}
      }
    }
  }
}
#+end_example

#+name: gitrepos
#+header: :var org="tensorflow" query=gitrepos-query
#+begin_src emacs-lisp :results replace vector value :exports code :noweb yes
(ghub-graphql
 query
 `((org . ,org)))
#+end_src

Filter the results, generate XML

#+name: tensorflowCore
#+begin_src emacs-lisp :var gqldata=gitrepos subdir="core" :results value html
(thread-first
  (thread-last
    (a-get* (nthcdr 0 gqldata) 'data 'organization 'repositories 'edges)
    (mapcar (lambda (el) (a-get* el 'node)))
    (seq-filter (lambda (el) (not (a-get* el 'isArchived))))
    (mapcar (lambda (el)
              (let* (;; (defaultBranchRef (a-get* 'defaultBranchRef))
                     (path (a-get* el 'name))
                     (ref (concat (a-get* el 'defaultBranchRef 'prefix)
                                  (a-get* el 'defaultBranchRef 'name)))
                     (name (string-join (list (a-get* el 'owner 'login)
                                              (a-get* el 'name)) "/")))
                (concat "<project"
                        " name=\"" name
                        "\" path=\""  (concat subdir "/" path)
                        "\" revision=\"" ref "\" remote=\"github\"/>")))))
  (cl-sort 'string-lessp :key 'downcase)
  (string-join "\n"))
#+end_src

#+RESULTS: tensorflowCore
#+begin_export html
<project name="tensorflow/adanet" path="core/adanet" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/addons" path="core/addons" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/agents" path="core/agents" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/build" path="core/build" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/cloud" path="core/cloud" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/codelabs" path="core/codelabs" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/community" path="core/community" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/compression" path="core/compression" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/data-validation" path="core/data-validation" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/datasets" path="core/datasets" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/decision-forests" path="core/decision-forests" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/docs" path="core/docs" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/docs-l10n" path="core/docs-l10n" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/dtensor-gcp-examples" path="core/dtensor-gcp-examples" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/ecosystem" path="core/ecosystem" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/embedding-projector-standalone" path="core/embedding-projector-standalone" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/examples" path="core/examples" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/fairness-indicators" path="core/fairness-indicators" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/flutter-tflite" path="core/flutter-tflite" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/fold" path="core/fold" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/gan" path="core/gan" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/gnn" path="core/gnn" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/graphics" path="core/graphics" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/haskell" path="core/haskell" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/hub" path="core/hub" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/io" path="core/io" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/java" path="core/java" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/java-models" path="core/java-models" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/kfac" path="core/kfac" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/lattice" path="core/lattice" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/lingvo" path="core/lingvo" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/metadata" path="core/metadata" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/mlir-hlo" path="core/mlir-hlo" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/model-analysis" path="core/model-analysis" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/model-optimization" path="core/model-optimization" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/models" path="core/models" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/networking" path="core/networking" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/neural-structured-learning" path="core/neural-structured-learning" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/oss-fuzz" path="core/oss-fuzz" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/playground" path="core/playground" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/privacy" path="core/privacy" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/probability" path="core/probability" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/profiler" path="core/profiler" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/quantum" path="core/quantum" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/ranking" path="core/ranking" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/recommenders" path="core/recommenders" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/recommenders-addons" path="core/recommenders-addons" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/runtime" path="core/runtime" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/rust" path="core/rust" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/serving" path="core/serving" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/sig-tfjs" path="core/sig-tfjs" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/similarity" path="core/similarity" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/swift-bindings" path="core/swift-bindings" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/tcav" path="core/tcav" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tensorboard" path="core/tensorboard" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tensorflow" path="core/tensorflow" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/text" path="core/text" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tfjs" path="core/tfjs" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tfjs-examples" path="core/tfjs-examples" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tfjs-models" path="core/tfjs-models" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tfjs-website" path="core/tfjs-website" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tfjs-wechat" path="core/tfjs-wechat" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tflite-micro" path="core/tflite-micro" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/tflite-support" path="core/tflite-support" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tfx" path="core/tfx" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tfx-addons" path="core/tfx-addons" revision="refs/heads/main" remote="github"/>
<project name="tensorflow/tfx-bsl" path="core/tfx-bsl" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/toolchains" path="core/toolchains" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/tpu" path="core/tpu" revision="refs/heads/master" remote="github"/>
<project name="tensorflow/transform" path="core/transform" revision="refs/heads/master" remote="github"/>
#+end_export

Generate =tensorflow_core.xml=

#+begin_src xml :tangle tensorflow_core.xml :noweb yes
<manifest>
  <<tensorflowCore()>>
</manifest>
#+end_src
